/*
 Navicat Premium Data Transfer

 Source Server         : cfmy
 Source Server Type    : MySQL
 Source Server Version : 50718
 Source Host           : localhost
 Source Database       : workflow

 Target Server Type    : MySQL
 Target Server Version : 50718
 File Encoding         : utf-8

 Date: 01/25/2019 16:35:38 PM
*/

SET NAMES utf8;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
--  Table structure for `bs_gx`
-- ----------------------------
DROP TABLE IF EXISTS `bs_gx`;
CREATE TABLE `bs_gx` (
  `id` bigint(20) NOT NULL,
  `name` varchar(255) NOT NULL COMMENT '工序名',
  `state` smallint(6) NOT NULL COMMENT '状态',
  `corporation_id` bigint(20) NOT NULL COMMENT '公司id',
  `price` float NOT NULL COMMENT '工序价格',
  `index_key` smallint(6) DEFAULT NULL COMMENT '顺序',
  `flag` smallint(6) DEFAULT NULL COMMENT '逻辑删除',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
--  Records of `bs_gx`
-- ----------------------------
BEGIN;
INSERT INTO `bs_gx` VALUES ('286212849657843712', '下料', '1201', '274257007794589696', '1', '1', null), ('286212903428820992', '单套', '1201', '274257007794589696', '1', '2', null), ('286212949171900416', '雕刻', '1201', '274257007794589696', '3', '3', null), ('286212998249451520', '抓架子', '1201', '274257007794589696', '2', '4', null), ('286213045905133568', '压机', '1201', '274257007794589696', '2', '5', null), ('286213103362904064', '精裁', '1201', '274257007794589696', '2', '6', null), ('286213469001355264', '打台', '1201', '274257007794589696', '3', '7', null), ('286213515331637248', '封边', '1201', '274257007794589696', '2', '8', null), ('286213588165726208', '大沙', '1201', '274257007794589696', '2', '9', null), ('286213627218890752', '异型', '1201', '274257007794589696', '3', '10', null), ('286213689990844416', '打眼订凳', '1201', '274257007794589696', '3', '11', null), ('286213733473193984', '分货', '1201', '274257007794589696', '2', '12', null), ('286213779501486080', '刮沙', '1201', '274257007794589696', '3', '13', null), ('286213813966082048', '贴纸', '1201', '274257007794589696', '3', '14', null), ('286213868068409344', '贴皮', '1201', '274257007794589696', '2', '15', null), ('286213925287104512', '底漆', '1201', '274257007794589696', '12', '16', null), ('286213987002093568', '油磨', '1201', '274257007794589696', '3', '17', null), ('286214037161775104', '面漆', '1201', '274257007794589696', '3', '18', null), ('286214151708217344', '包装', '1201', '274257007794589696', '23', '19', null);
COMMIT;

SET FOREIGN_KEY_CHECKS = 1;
